import numpy as np
import matplotlib.pyplot as plt


def getrsr(x1, x2, x3):
    return (0.4 * x1 + 0.4 * x2 + 0.2 * x3) / 30.0 / 2.5


plt.rcParams['font.family'] = 'SimHei'
plt.rcParams['font.sans-serif'] = ['SimHei']
plt.rcParams['axes.unicode_minus'] = False
radar_labels = np.array(['查找算法', '排序算法', '树结构', '数字操作', '数组', '图结构', '线性表', '字符串'])
nAttr = 8
data = np.array([[getrsr(251.79496749999944, 107.24627636873655, 178.4047178379402),
                  getrsr(211.86846763126294, 1018.5827714740391, 214.65139570001386),
                  getrsr(286.9519177460003, 93.90198320229642, 196.7482233536144)],
                 [getrsr(256.9822236815443, 83.39922774107929, 207.86903953326527),
                  getrsr(240.526919002542, 536.5316369130456, 201.68233059216192),
                  getrsr(228.46583483149647, 84.11869405792777, 187.51355388421064)],
                 [getrsr(302.29216352467245, 155.86928481633032, 193.0086112850572), getrsr(230.6, 94.56, 243.31),
                  getrsr(288.61001210423495, 116.80149755620135, 185.1174313790858)],
                 [getrsr(221.03173603721885, 91.42815181660883, 237.84101915375814),
                  getrsr(246.7699894244141, 440.0839393516973, 165.94868897035144),
                  getrsr(227.8845167913886, 102.1102591671166, 180.33143729224267)],
                 [getrsr(194.22392265628017, 133.79722703993878, 218.17611216437763),
                  getrsr(295.3024783789493, 95.5640094735582, 231.67525659003263),
                  getrsr(202.76024923048448, 136.13940978994657, 273.87872204925)],
                 [getrsr(324.2589973452143, 135.20758429827876, 226.81933708390434), getrsr(0, 0, 0),
                  getrsr(330.8795439364749, 201.5201472702364, 192.49418092511874)],
                 [getrsr(243.6375651833353, 228.23396438170775, 149.29687906120006),
                  getrsr(257.38260261064084, 85.99283982116678, 210.55033984808665),
                  getrsr(190.41358007234737, 101.82955914931013, 322.90046087611034)],
                 [getrsr(244.91997125394883, 262.2129282626819, 180.14742084190607),
                  getrsr(247.36480581618378, 131.99744322082086, 213.19321663084628),
                  getrsr(232.00452326908268, 114.4208047775664, 299.91428255424535)]])
data_labels = ('user60580', 'user60778(推荐位第一)', 'user60836(推荐位第五)')
angles = np.linspace(0, 2 * np.pi, nAttr, endpoint=False)
data = np.concatenate((data, [data[0]]))
angles = np.concatenate((angles, [angles[0]]))
fig = plt.figure(facecolor="white")
plt.subplot(111, polar=True)
plt.plot(angles, data, 'o-', linewidth=1, alpha=0.2)
plt.fill(angles, data, alpha=0.25)
# print(angles * 180 / np.pi)
plt.thetagrids([0., 45., 90., 135., 180., 225., 270., 315.], radar_labels)
plt.figtext(0.52, 0.95, '互补型匹配雷达图(60580)', ha='center', size=20)
legend = plt.legend(data_labels, loc=(0.94, 0.80), labelspacing=0.1)
plt.setp(legend.get_texts(), fontsize='large')
plt.grid(True)
plt.savefig('互补型匹配(60580).jpg')
plt.show()
